const Map<String, List> BUILDINGDATA = {
  // "건물번호" : [x좌표, y좌표, 식당여부, 건물명, 소속 단과대, 소속 학과(부)]
  "300": [0.345, -0.6, true, "유회진학술정보관", "공과대학",],
  "301": [0.37, -0.705, true, "제 1 공학관", "공과대학", "기계공학과, 항공우주공학과, 컴퓨터공학과, 전기정보공학과"],
  "302": [0.365, -0.795, true, "제 2 공학관", "공과대학", "화학생명공학과"],
  "310": [0.52, -0.805, true, "엔지니어하우스", "공과대학",],
  "311": [0.45, -0.778, false, "화학공정신기술연구소", "공과대학",],
  "312": [0.445, -0.615, false, "정밀기계설계실험동", "공과대학",],
  "313": [0.44, -0.585, false, "정밀기계설계공동연구소", "공과대학",],
  "314": [0.40, -0.55, false, "차세대자동차연구센터", "공과대학",],
  "316": [0.575, -0.905, false, "대형구조실험동", "공과대학",],

};